app/controllers/base_controller.rb

INSERT INTO "users" ("name", "email", "token", "uid", "created_at", "updated_at", "refreshtoken", "expiresat") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = $1  [["email", "ashwini.mandal@cuelogic.com"]]
UPDATE "users" SET "token" = $1, "expiresat" = $2, "accesstoken" = $3, "updated_at" = $4 WHERE "users"."id" = $5
---
  def create
        auth_hash=request.env['omniauth.auth']
        session[:uid]=auth_hash.uid
        puts "aaa",auth_hash
        expiresAt=User.setExpireAtFormat(auth_hash.credentials.expires_at)
          if auth_hash.credentials.refresh_token
          user=User.new(name:auth_hash.info[:name],email:auth_hash.info[:email],token:auth_hash.credentials.token,uid:auth_hash.uid,refreshtoken:auth_hash.credentials.refresh_token,expiresat:expiresAt)
          user.save
        else
          user=User.where(email:auth_hash.info[:email]).update(token:auth_hash.credentials.token,uid:auth_hash.uid,expiresat:expiresAt)

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def displaySentMail
      #@gmail=User.loginGmail
      #User.sentMails(@gmail)
      if User.validateAccessToken == 1
        responseData=getAccessToken
        User.last.update(token:responseData,expiresat:Time.now_to_s)